// menu-data.ts
export const menuData = [
    {
        name: "مردانه",
        children: {
            کیف: ["دوشی", "کوله", "اداری"],
            کفش: ["کتانی", "چرم", "بوت"],
        },
    },
    {
        name: "زنانه",
        children: {
            کیف: ["مجلسی", "کراس‌بادی", "توت"],
            کفش: ["پاشنه‌دار", "کتانی", "بوت"],
            لباس: ["پاشنه‌دار", "کتانی", "بوت"]
        },
    },
    {
        name: "بچگانه",
        children: {
            کیف: ["مدرسه", "کوچک"],
            کفش: ["اسپرت", "صندل"],
        },
    },
    {
        name: "اکسسوری",
        children: {
            عمومی: ["جاکارتی", "نگهدار کلید", "کلاه", "کمربند"],
        },
    },
];
